node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1905536
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "$\3735\274\0233\256=\"\317\272\275S\261\332=\375\3521\276\226\000\212\275\350BH\275\n\016\216\273\261\007T>a \005>\030}\303\275vr\303=\265\3368>\230\220\371\274\007\345\221<\3671S>\237a\351=\211\301\024\273\353M\333=\352\3171>y\376\230\273@\367\031>\204\3479=\264\026\020=.<\327\275\2138\222\274\233:\205\276vY\226\276[\334?\276k\260\360<\235E\014\275\305\272\216\275\3247\272=\r/\274\2750t\022=\010N?>\246Z\004\276\211\374O=\037\324O\275\205PS\276\305\002\367\273\352\202\032\274\036\247\214>\231\240\371=5\304\323=F\344\013\275\246\325F\275\204t\036=9P\'>\037\004\324<\322K\206=\256Q\207\275\023#l\276E\267\325\274$\343\257=6\340s=\3334\254;\201\214\254>\321\324\221\274\330\331p>\343!\230>\0079k\275\354\017a=\217,\000\2768d\307\275\272y\261\275t\334\365\274#\026\037\276\353|\033\276\375\261G=\003\345?=J\030\350\274\367\013\216=5C\310=S\206\030>\004h\204>t\367\346=\0038(:\343\341,=\350\306q=CH\034>%\\3=u+Y>\363\007\327\275\2635\240\275\302\014\367=\360)\237>\356\026\020=/\022)\276\326\335\267>#\031t\275\022\202Z\275Z\027\236\275\263\310\010\275\336%N\275h \255\274\na\311<xL\004>\037\260O=OI\215=y\202\006\276\226s\207\275r\302u\276B\\\036\275\331\013\235>\204\246\306\274\370\310b\275^\206\372\274\252.\213\275\374=\221=w \r>\235\261\306\275\345L\337\275\032,\201=\363<\177\275\311\000\032=\377\254\245=S\002\264=~Z&\276\0103\026\276\377\203r<\273\330\232\276\310r\022>s\366\205\275f5\'\276\021\207.=@gD=\247N\360=U\371\363=V\2534\276\030T\215=\033w*>\366\007$>v\361\031\276e\220;>\2160\374\275\372\240F\273\361\357\035=\275aM\274\220w\030>h\342\034>-\252\252\275\t\025\203\275\345\220\017\275\350\2137\276Z\257X\276\"k\322=^\n\230\274\322\254\323=E\302z=\034\307\314\275\t\346\030>\031A\312=\245\254\356\275\341\251=\276\365I\017>\031v0>\307\201R\275\305\225\350\275\'\002\'=\303\271\263\274NB3>\366\217~\275W\356\002\276\375\264\034\275@/\226<\274l\016\276\271`E\275W\326+>\251=,\276\377\2557=C`\346=\017\252\357=\265\310\205\2759\271\343\275f\327Z\276\337\266\217>\321\203!>\272\203\000>;\242\214=\345\254\203>\205\353\001>H\206\273\276\345\001\335=`\022\220\2748\306\314=;b\232\275H<+\275\314\337==\024\200f\276\202p.>\026\372\212\275\323&\032>sv\306=\221Sc\275\017\r!\272bfn\275\227\304I=*\037\260\276\3432\230<\177\307p\276\232t\035>\356\333\002\275\300\337y>\241\000\t\276\326\033\374;\342\360\024\275\032\250\';\252L\336=\344\361\303=\376\t\262\275\216.\200<\371\357\234=\330@\265\274QK\245\2748~;<@5\'>I:\341\275n\351\344\273P\307<>\010M/\275\317c\037>5/\026>\320\021i=\311X\261<w\273\247\275\275o\002=\212\321\347\275\257\252\341\274\241)\362\275\205Ff\274\250\264\275=\270\312\355\275\266\036\016=\206\337\014\276\261V\334\275\005\235\037\276,\336\253=C\0171\276\233\277J\276o*\344\275\240\276B\275\t\357\255\274\035\301\266>|\220\336=|s7\276\303\236\366\275\363\001#\276\001\r\026\276\332z1\276\030:\202=\003\336\230=\345b\221\275\257\024\366=\361\035\000\276\346A\336\275\202\017\026>{\022\317=\0050\303\275\035\324\327=\004\356\276<i\223\n\276\220f#=\203\334\300=;*\253>]\026#\275\002\256h=\341)k=i\216\271=9\010\203>7<Z\275\007\2216\276\324\266_>W\317\232=Q\200\032>\232\002\213=\311\276\014>1\3334>\364g.>3\251B\276\204\232\027>\014o\220<\303\005\016\275\253\226\227=L\006\017==z\036=\010\366u\275Y\221s=\374xc=\231\303H=\237\322\321=k\232\t\271W\t\013=\332R\221=`L,\276\310\314\343\275\273\036_=\004m\266=)9!>\327\t\033>\345O\017\276}\224\031\276\374>&\276XRz>\225\033v=\346O\271=\307\027M\276k\317(\274\372\253\201<\014Y\350<s+\310=T\347}=$4\377=\031f?\275\261\227g=xv\204>\234\335?=\307\013\213<\364r\250\275#\373~\274\262\270?\274\021\235\315=+\"\237\276\321\360)\276M=\213\274\233\371\212>}\300\373\273b\220\364=9\247\010=\334\324\024>x6\026>\247\232F>T.\306=E\271\222\275\360\306\316=FE\226\2757p3\276N\236T\275\231\\\233\275X\000\233=\323G\235<M\245&\276Wt\003\276\243:\304\276\014\312\177\276\220z\251\274\346%\300\275\020-\017\2752\230\201\274\337\364z=f\014W;@\344%\276\031\203\025;\200\033\300=\300\331\300=\016\323\250\275\372\335\246\274\206\323\257=J\325\221<\264\te=\356\223\330=\346]\262\275\362\034T\275\355a\005>\342a\"\276\230|\332;\355\302\332<\024-\027>\224w\200<$qW>\232\317H<@\360\235\275*\207\001\274\357\231\030>F\037J\275NM\345=S\341\232\275E\334*\276\277:\037=\2152\271=\222\211D=\033\242\206=\306\027\207=\354\365\254\2769\301\252\275\200}o\276\0270h=\013\2145<\032\324\254=\365T >k0\351\275r\007\020\275aY\377=e\032\356\274\231\261c>\340[\005\276\365%\037\275\274\315\200\276\315\334\277=%\3103>}\357i>\347\203\003=\026\357\016=,\000\234=s\310\346<1\257\305\274\021k\013>\357\324i>\231\337\224=r\372\234\275\327H0\276B#\r\276\007%\205;j\221M\276\301\nd\276\372\006\"\274V\273\026\276\323\350\347\275\220=T>g\2617<|\355\200=\335~\241\274\334\224\016\276\263\222\300=\371p#\276P\244\272\275\035\377\320=4|\371=&\254\021\276\253%b>\377\311\236<\374\027\024>\263\343\275\275:\3444\276\226\362E>Mt\250\275}t\007>\016+\036>\301\257\"\275\004\364\224>\0368.\275r\230\324\27563\336\275\2622\035>\377\r:=d\362>>\332\303\t:#s8\276\227R\264\274L=\033\276Y\032\257\274\023\335\333<`\276<<\201\304=\2764\0322>_\r\246\275\242+\006>psc>w\003\t<\331<\013>\373GX\276\000\203\256\275:\241b\276W\312\217=\366X;\275;G\030\276tQB>\367\317Y>\'\3218\275\255\022\001\275v\3236\276\345\032\014>Q\234\313\275\323Rn\275>6\317\272\000o\355\275N\325\034\275\335<\370\275\216\201\222<r#\216<<\230\\=x\t\223\275\204Z\221=\363E\\=\274\315\305\275\\\2455\274\326a\307\275`\256\216>\212\273v>;\242\014\276\021\340J\275\002JC>\031ad\276C\233/>\026\223<=:1\314=8H\363=\317\037\023>\274\215\261=\331\246\\\276z\363\016\276!\2274\275\215\233*<\333v\312=~\306\301=\271\026h\276\234?1\275\007\307\336=\023\351\007\276\244\305b=\220\370p<+\037(\275Qd2>#\233z\276\305\234\026=o\021\304\275\216\277\025\276`\006]\275\310w \276g\232Z\273mV\356\275\243\207g\275l\"\224\275\315Q+\275\0354e>ub\036\276\020\207\367\275%\302\253=\024\257I\275\333\303\245\275?\204\275=\204\3073>\231\252 >X\336`>\037\264D=FD\204=\200\220u\276G{\271\275\273O\033;\013k\033\275V\030\305=Ig\236=\346\227\016\276\377J,=W\014*>\27751\276Oc\276=\200`\256\275\353<\217\275\363\374\244>\325\301\030=\265x\302\275\373\362s=\346\335w=E\374K=\007\037\001\276\364\342\262<P\024\001>N\357:>\307\214#>\272\333X=\364\277\022\275\314\234J\276\244^\023<\357?\237=\016#\253<\352\235\301\275\350\355\005>\033\357\037\276{H\302=\310\276h\273\235\000\241\273\037a(>\250o\357\275\267\030B\276B\310\223\275l\245\r\274\317\261\260\274\"x}\276\223\226\037\273\264\351\035>X\224\275>\362\250\261=\256\272\351\275\214\241\271<qj\037>\204*)\276\272\274\000>[\356\231\275~\205\363=\250\002,=\016,\002>\230?]>\204\2327\276\201\370\356;\031\023\267=\314\230S\275\007\354\201\271H\243(\276bZ\357\275\227\362\013\276\243\021\017\276\036\360\202\275\224=\036>\261\206\224\276\271\323\034>BM\366=gT\372\275\215\"\376<\210\336\202<\314\2107;\305\343@\276\206]\003=y\314k\275\303\230\325<6\354@\276\241c\016\276Di8\275Q\316\r>Vu\022=\215<\223\276\032dh>\216\337-=\273b<\275\341\215\224\274\2550\223\275\336\212\027>0\3042><\346\212<N\221\211<\254\246\272=|\314(\276\313An=\301u\312\275\373\344\201\276\270\225\265;\007!\330\274\257q\273>J\243\221\275n\367\375=\315+\343=7\007D\276\324\004\233=\034\'\372<x\206[\274\010\222\254\275\223i\242=\335\330\223<\346)\224\276\010\311\335\273\014\247n=\200\245\007=\t\214C=Vh\236<0j,\273\362\245\357=\007y\337<\275N\022>\337\251\003>O\262\r=;w\022\276\253\315\000=\272\245\302\275\r\207\033\276*\251\361\275\225\325\210<\372\267\024>\274\254E\276-\240&>\356d\356\274\324\356\306<\320\212\274\275\264\3057\276\277\203O>foj>\226N\357\274\325\352\332\275`4m=\034\203H\276\367\372=>\r\212%=\004b\241=|\021\271\275\344\227\255=\274\265\202\275\365+\363=M\322\233=\313\237\014>4\304\013\276\034\352\035\276-2,\276\253h\325=\332\214\004>\"\236Q>D*\275\275\255\341\372\275@nE<\362/\332\275\364\247c>^K\300;yw)=%\213\364\274\263\335\251\275m\201\372\274\344g\\=\177\006G\276\364\230\214\276\374#\311=\235\275!>\300\005\225<\243\263\030>\207\035\311\273\006\3023\275s{\001\275\215:\340\272\212\323\037>\330\321\250\275\236\347\372\275\027\310\365<$\033\241>\370\206~\274\370?\375=g+>>+\244\000>\006\002\312=\014\320\'\276\226$O\275Ih\203\276\370#\212=\331\370\250<>dN>\377\377\272<\355\317\n\276o\005\346\275\223L\230>^\271<>y\230\254;\026\313\007>\246F\331<\352\262\037\276\333_}>\233]]>O\027\202\275\233&\030\276\215\230\t\275|F\026\276\343F\331=\003q\377\275\025B\027>\210\204=\276s\250\344=\334\027\177\274\210{\365=\034\310\361=\010^\n>\220\327\257\275g\214\">\305\030\231<5a\033\276\177\221\323==x\357<\326\241\300=\334\242)=\3376\035>\230=\273\275\271\2052=\262\244{=C S\275\246\033W\276\3400h\276\245\212\366=\217Z\004>ev\261\275\221jj=r\232\023<\2732\246=\027n\364\275=\303\274=eaJ\274NiU=x\202\205\275Vh\205=\030\257\270=\215u\335\275\360\027\372\273\037\363S=g\352\336\274\010\320\317=\263\236\320<\347\2067\275\335\033\227>\300\341\274\275\316\024\330\276\245e\201\276\021\200\266<\227\354\271=\207j|\274\007\025\252\275\301W\263=\360\217\203>,\364\023\276\213\032\317=9\226w=^\267v>\317\337\213\275\200O\240=\357B\350\275\271\220\343\275\350\327\267=\257\270\242>E\260\331\275\303b\013\275\010\253\307\275\241\'\333<\274\017\007>Z\014\202=\227\321v\275\310\311\325\275\270\'><c\243#=\201\005\033=5\252\t>%\334\310\275Ag\217\274\001\005\377\275\314\301e=\317j\023\275\370\212x:\233\037\n\275\361,\303<\2714\206:x\0133\275\336\033<>\032Ux=\257\351\021=\302\\\225>\030\nm=Wf\030>v\007\014>T\334\300\275n\207\245\275\033T\216>\204\033N\276\324\205\222>\354zR\2740\":>\241\317\330\273P|\2678\264Q\266=;\243\t=(e\354\275\247\222t<\373\236\363=\317\247\233\275\177\254&\274\362\277\232=\022#\030>\244\010\365=\227\210\325<,X\216=\007\232\333\275\377\244\305\275\343]\374<\326\270\364\275AI\377\275\365\202\327\273\004\2474>\272\300\256\275\377\025\367<5\004\272<\330hL;2I\007=~\022l\276\2678\331\275\023\016-\275\342G\377\275!hM\2740f\267<\345\315V<\303\034\202=Pe\232\274\006\351\317=j\274\345\275)v\221>\234z\016=\3468\203>\375\333f\276A\324 \276Z\306\331=\253f\000\276f\322;>1\253\347\274\226\021\007>\300\326\230=k\307\226=k\357\307=\273,\370=\267\n\237\276[\262;>aE\317<\315\337\217\275\350*\202\275\342_\354=\363\344\226>\023\340;<cO\031>o\337)\276\373\335I\273\276Q\226\274\352\265\246;\240\252\030=W\000V<!\237\301\275k\300\206>\036s\217=\031\350\302\274\235\na\275[)C=Mt\345=4\240\033\274\241\353\201<\334Z\025\276\232r\304=\022\\F>\270A\230\276s\244\311\275 \200\326\275d\325:\276rO\226=q;\256=SI\014\275\003\360\357=R\230\306\275\274\311\001>;\025B\276\3252\270=\234\325\351<\345\302\250=\221?\343<\3411\\\275\330#^\275\323A\277\275b\000\304\275&\334\202\276\017S\251<\224\363\230>i\245Q\273\313m\220=\366\0316\276\354\362\305;\204g\205\275|w\234=\371[^\276\330U\206\276\366\330\214\275\3434\236=\256\3328\276\031\t\014\276Q\362\274\275\241\213\305=\003|y\275\265\031\214>\212\372\344\275\264\032\264\275Ts\256\274\215\001]>\020\311s=2\025\031\275\006\365l<i\206\321<\222>\206\275\367\271+>$!\t\275\262\247\242=\026O\341=\211\276$=\272\367\035>\345\321,>Lq >\306P\332=\343#\246\275\275L\201;r5\262>\371=7=\372\277\037\275\226\202\330\274S\026\214=\363%\202>p\267\324\274\264\270\032\276\254\177\300\275\263\335\017\276a\251W>\326\243\214>)\245\253=\352\343 =\230\311\321\275\027#\006\276 \265\211\276\024\014\021\275\241LT<\3478\212\274:U\002\276i\276\312\275\014w&\276V\302\265=\203Y\334;\214\301\345;\266\375\213\275\256\220T=\257\367\363\275}gC\275\270\002\362\275\'g\230;\016\0061\275\300P\205\276\215\356\341=J\377\337=\037~\351=j\371\t\276V\317\177\276\017\306\367;F\272\370=\013\202\363=s\252\">\302\227\211\275\364s\233<\334\264\260\275Zm&>dme\276\271Z\000\276\264c\016\276_\217\342\275A\302T=\365\364\n>\213o\024=\305\3776>dy\320\274\361\212?\275@\275\223\274zN\300\274\026\327\225=\341\212\362\275\274g\212\275\035\365\361\274>\230\267\275\304-\203\274T\227&>\342RQ\276\222m\220=\343\270N\276\332\'.\276)\'\260\276\307\255l\275\237\361\275=\000d\307\275 {*\275H\023#>\341\035\334\275[\214\211>\007\3659\276A(\247=\\\\\226=\265\016z<\032wQ\275\307\227\214\274\266\032\210=0\323\220\274U\'b>\007e\031>\035\033A\276\271\212\021=\336s\006:\253Dq\276+\220\317\275\310I\360\275?\002\017\274\302\\\361=\375~\266\275\304\003#\274\371\217=\275\"\r\360=0*5=r\267B>e\224X\276\217k\317=D\'#=\325\'#>\312dS\275n\304\205=\211\033\036\275\270;6\276\005\217\210\275\310\305\271<\223\241\\\276\032\303\352\275\205r\211=\250/\002=\2321\177=Q\362C\276^\353\204>:\2323>tJ\036=Zy\263=*g;\274\254R\"\275\2633#>\235%\251\275\234\3412\275\347\235\253\275\r\213@\276W\r=>UX\333=\365<\363\275\345(?>t\234\246\274\361\376M<A\3035\275\023\207\341=\214\371.=vBS<\311\200\004\276\373\t\212<.D\277\273\034A\205\276TZ\376\273*m\"\276F\304u=fVR=\021Nk>x\334%>\325\244g>\264\\\006\275\036\003\263<_\245\320\275C\017\214=\244\"i>\221\033\301=\335\272\205\276\003\337 \276\010\200\341=O\371\214\274\200S\312=\177\027:<\235\375\267=\014w\353=J\350\375\273Qt\016\276\333\252\030>b\225\003>\262\005b>#\312\031>\314MF>;OO\275\362:\324;\315\001\322\2748\225X\276\206M\350\273\352+t>\344t\263=-\013\342\275\220t\025\276\253\346:\276Og\243\274|z\364=:\277\021\276 \356\010\276\216\2275>JA\370<v\220\021>\013\035\211\276\232\234\030>{\210\272\275\026]B>\001\031\225<i\361\275<j}\001<OL\261;\302\371\266\275\376}\346<|T\262\275[\237\236\276\007\240\226\275\237\274\245>\301\341\374\2759?\333\271g\332j=\305\336\360=(N\014>(c{=#\201\030>\307\225\010=\204/\231\274\222\214\026>9\210f\275m\330\214\274\346X\207\275\350\327\270\274\272E<\276|,\325\274"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
